7767517
270 349
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 9=1
Split                    splitncnn_0              1 2 1 2 3
Convolution              convrelu_1               1 1 3 4 0=16 1=2 11=2 12=1 13=1 2=1 3=1 4=-233 5=1 6=2048 9=1
Convolution              convrelu_2               1 1 4 5 0=32 1=2 11=2 12=1 13=1 2=1 3=1 4=-233 5=1 6=2048 9=1
Padding                  pad_8                    1 1 2 6 0=0 1=1 2=0 3=1 4=0 5=-3.402823e+38 6=0
Pooling                  maxpool2d_7              1 1 6 7 0=0 1=2 11=2 12=1 13=0 2=1 3=0 5=0
Concat                   cat_0                    2 1 7 5 8 0=0
Convolution              convrelu_3               1 1 8 9 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432 9=1
Convolution              convrelu_4               1 1 9 10 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=1
Split                    splitncnn_1              1 2 10 11 12
Convolution              convrelu_5               1 1 12 13 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_2              1 2 13 14 15
Convolution              convrelu_6               1 1 15 16 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_3              1 2 16 17 18
Convolution              convrelu_7               1 1 18 19 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_4              1 2 19 20 21
Convolution              convrelu_8               1 1 21 22 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_5              1 2 22 23 24
Convolution              convrelu_9               1 1 24 25 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_6              1 2 25 26 27
Convolution              convrelu_10              1 1 27 28 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Concat                   cat_1                    7 1 11 14 17 20 23 26 28 29 0=0
Convolution              convrelu_11              1 1 29 30 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=21504 9=1
Convolution              convrelu_12              1 1 30 31 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
Split                    splitncnn_7              1 2 31 32 33
ConvolutionDepthWise     convdw_189               1 1 33 34 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1152 7=128
Split                    splitncnn_8              1 2 34 35 36
Convolution              convrelu_13              1 1 36 37 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592 9=1
Split                    splitncnn_9              1 2 37 38 39
Convolution              convrelu_14              1 1 39 40 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Split                    splitncnn_10             1 2 40 41 42
Convolution              convrelu_15              1 1 42 43 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Split                    splitncnn_11             1 2 43 44 45
Convolution              convrelu_16              1 1 45 46 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Split                    splitncnn_12             1 2 46 47 48
Convolution              convrelu_17              1 1 48 49 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Split                    splitncnn_13             1 2 49 50 51
Convolution              convrelu_18              1 1 51 52 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Concat                   cat_2                    7 1 35 38 41 44 47 50 52 53 0=0
Convolution              convrelu_19              1 1 53 54 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=180224 9=1
Convolution              convrelu_20              1 1 54 55 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=1
Split                    splitncnn_14             1 2 55 56 57
ConvolutionDepthWise     convdw_190               1 1 57 58 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608 7=512
Split                    splitncnn_15             1 2 58 59 60
Convolution              conv_92                  1 1 60 61 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
ConvolutionDepthWise     convdwrelu_0             1 1 61 62 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_16             1 2 62 63 64
Convolution              conv_93                  1 1 64 65 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_1             1 1 65 66 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_17             1 2 66 67 68
Convolution              conv_94                  1 1 68 69 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_2             1 1 69 70 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_18             1 2 70 71 72
Convolution              conv_95                  1 1 72 73 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_3             1 1 73 74 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_19             1 2 74 75 76
Convolution              conv_96                  1 1 76 77 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_4             1 1 77 78 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_20             1 2 78 79 80
Convolution              conv_97                  1 1 80 81 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_5             1 1 81 82 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Concat                   cat_3                    7 1 59 63 67 71 75 79 82 83 0=0
Convolution              convrelu_21              1 1 83 84 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=851968 9=1
Convolution              convrelu_22              1 1 84 85 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Split                    splitncnn_21             1 3 85 86 87 88
Convolution              conv_100                 1 1 88 89 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
ConvolutionDepthWise     convdwrelu_6             1 1 89 90 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_22             1 2 90 91 92
Convolution              conv_101                 1 1 92 93 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_7             1 1 93 94 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_23             1 2 94 95 96
Convolution              conv_102                 1 1 96 97 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_8             1 1 97 98 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_24             1 2 98 99 100
Convolution              conv_103                 1 1 100 101 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_9             1 1 101 102 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_25             1 2 102 103 104
Convolution              conv_104                 1 1 104 105 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_10            1 1 105 106 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_26             1 2 106 107 108
Convolution              conv_105                 1 1 108 109 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_11            1 1 109 110 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Concat                   cat_4                    7 1 86 91 95 99 103 107 110 111 0=0
Convolution              convrelu_23              1 1 111 112 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1114112 9=1
Convolution              convrelu_24              1 1 112 113 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
BinaryOp                 add_0                    2 1 113 87 114 0=0
Split                    splitncnn_27             1 3 114 115 116 117
Convolution              conv_108                 1 1 117 118 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
ConvolutionDepthWise     convdwrelu_12            1 1 118 119 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_28             1 2 119 120 121
Convolution              conv_109                 1 1 121 122 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_13            1 1 122 123 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_29             1 2 123 124 125
Convolution              conv_110                 1 1 125 126 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_14            1 1 126 127 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_30             1 2 127 128 129
Convolution              conv_111                 1 1 129 130 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_15            1 1 130 131 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_31             1 2 131 132 133
Convolution              conv_112                 1 1 133 134 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_16            1 1 134 135 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_32             1 2 135 136 137
Convolution              conv_113                 1 1 137 138 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_17            1 1 138 139 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Concat                   cat_5                    7 1 115 120 124 128 132 136 139 140 0=0
Convolution              convrelu_25              1 1 140 141 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1114112 9=1
Convolution              convrelu_26              1 1 141 142 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
BinaryOp                 add_1                    2 1 142 116 143 0=0
Split                    splitncnn_33             1 2 143 144 145
ConvolutionDepthWise     convdw_209               1 1 145 146 0=1024 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=9216 7=1024
Split                    splitncnn_34             1 2 146 147 148
Convolution              conv_116                 1 1 148 149 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
ConvolutionDepthWise     convdwrelu_18            1 1 149 150 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384 9=1
Split                    splitncnn_35             1 2 150 151 152
Convolution              conv_117                 1 1 152 153 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
ConvolutionDepthWise     convdwrelu_19            1 1 153 154 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384 9=1
Split                    splitncnn_36             1 2 154 155 156
Convolution              conv_118                 1 1 156 157 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
ConvolutionDepthWise     convdwrelu_20            1 1 157 158 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384 9=1
Split                    splitncnn_37             1 2 158 159 160
Convolution              conv_119                 1 1 160 161 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
ConvolutionDepthWise     convdwrelu_21            1 1 161 162 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384 9=1
Split                    splitncnn_38             1 2 162 163 164
Convolution              conv_120                 1 1 164 165 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
ConvolutionDepthWise     convdwrelu_22            1 1 165 166 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384 9=1
Split                    splitncnn_39             1 2 166 167 168
Convolution              conv_121                 1 1 168 169 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
ConvolutionDepthWise     convdwrelu_23            1 1 169 170 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384 9=1
Concat                   cat_6                    7 1 147 151 155 159 163 167 170 171 0=0
Convolution              convrelu_27              1 1 171 172 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3407872 9=1
Convolution              convrelu_28              1 1 172 173 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2097152 9=1
Convolution              conv_124                 1 1 173 174 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=524288
Split                    splitncnn_40             1 2 174 175 176
Convolution              conv_125                 1 1 144 177 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=262144
Convolution              conv_126                 1 1 56 178 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=131072
Convolution              conv_127                 1 1 32 179 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=32768
Interp                   interpolate_0            1 1 175 180 0=1 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp                 add_2                    2 1 177 180 181 0=0
Split                    splitncnn_41             1 2 181 182 183
Interp                   interpolate_1            1 1 182 184 0=1 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp                 add_3                    2 1 178 184 185 0=0
Split                    splitncnn_42             1 2 185 186 187
Interp                   interpolate_2            1 1 186 188 0=1 1=2.000000e+00 2=2.000000e+00 6=0
BinaryOp                 add_4                    2 1 179 188 189 0=0
Convolution              conv_128                 1 1 176 190 0=64 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=0 6=1327104
Convolution              conv_129                 1 1 183 191 0=64 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=0 6=1327104
Convolution              conv_130                 1 1 187 192 0=64 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=0 6=1327104
Convolution              conv_131                 1 1 189 193 0=64 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=0 6=1327104
Split                    splitncnn_43             1 2 193 194 195
Convolution              conv_132                 1 1 195 196 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=0 6=36864
BinaryOp                 add_5                    2 1 192 196 197 0=0
Split                    splitncnn_44             1 2 197 198 199
Convolution              conv_133                 1 1 199 200 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=0 6=36864
BinaryOp                 add_6                    2 1 191 200 201 0=0
Split                    splitncnn_45             1 2 201 202 203
Convolution              conv_134                 1 1 203 204 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=0 6=36864
BinaryOp                 add_7                    2 1 190 204 205 0=0
Convolution              conv_135                 1 1 194 206 0=64 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=0 6=331776
Split                    splitncnn_46             1 2 206 207 208
Convolution              conv_136                 1 1 198 209 0=64 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=0 6=331776
Split                    splitncnn_47             1 2 209 210 211
Convolution              conv_137                 1 1 202 212 0=64 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=0 6=331776
Split                    splitncnn_48             1 2 212 213 214
Convolution              conv_138                 1 1 205 215 0=64 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=0 6=331776
Split                    splitncnn_49             1 2 215 216 217
Convolution              conv_139                 1 1 217 218 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Split                    splitncnn_50             1 3 218 219 220 221
Convolution              conv_140                 1 1 221 222 0=32 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=50176
Convolution              conv_141                 1 1 220 223 0=32 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=7168
Convolution              conv_142                 1 1 219 224 0=32 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=7168
BinaryOp                 add_8                    2 1 222 223 225 0=0
BinaryOp                 add_9                    2 1 225 224 226 0=0
Split                    splitncnn_51             1 3 226 227 228 229
Convolution              conv_143                 1 1 229 230 0=32 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=25600
Convolution              conv_144                 1 1 228 231 0=32 1=1 11=5 12=1 13=1 14=2 2=1 3=1 4=0 5=1 6=5120
Convolution              conv_145                 1 1 227 232 0=32 1=5 11=1 12=1 13=1 14=0 2=1 3=1 4=2 5=1 6=5120
BinaryOp                 add_10                   2 1 230 231 233 0=0
BinaryOp                 add_11                   2 1 233 232 234 0=0
Split                    splitncnn_52             1 3 234 235 236 237
Convolution              conv_146                 1 1 237 238 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_147                 1 1 236 239 0=32 1=1 11=3 12=1 13=1 14=1 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_148                 1 1 235 240 0=32 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=3072
BinaryOp                 add_12                   2 1 238 239 241 0=0
BinaryOp                 add_13                   2 1 241 240 242 0=0
Convolution              convrelu_29              1 1 242 243 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
BinaryOp                 add_14                   2 1 216 243 244 0=0
Convolution              conv_150                 1 1 214 245 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Split                    splitncnn_53             1 3 245 246 247 248
Convolution              conv_151                 1 1 248 249 0=32 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=50176
Convolution              conv_152                 1 1 247 250 0=32 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=7168
Convolution              conv_153                 1 1 246 251 0=32 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=7168
BinaryOp                 add_15                   2 1 249 250 252 0=0
BinaryOp                 add_16                   2 1 252 251 253 0=0
Split                    splitncnn_54             1 3 253 254 255 256
Convolution              conv_154                 1 1 256 257 0=32 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=25600
Convolution              conv_155                 1 1 255 258 0=32 1=1 11=5 12=1 13=1 14=2 2=1 3=1 4=0 5=1 6=5120
Convolution              conv_156                 1 1 254 259 0=32 1=5 11=1 12=1 13=1 14=0 2=1 3=1 4=2 5=1 6=5120
BinaryOp                 add_17                   2 1 257 258 260 0=0
BinaryOp                 add_18                   2 1 260 259 261 0=0
Split                    splitncnn_55             1 3 261 262 263 264
Convolution              conv_157                 1 1 264 265 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_158                 1 1 263 266 0=32 1=1 11=3 12=1 13=1 14=1 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_159                 1 1 262 267 0=32 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=3072
BinaryOp                 add_19                   2 1 265 266 268 0=0
BinaryOp                 add_20                   2 1 268 267 269 0=0
Convolution              convrelu_30              1 1 269 270 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
BinaryOp                 add_21                   2 1 213 270 271 0=0
Convolution              conv_161                 1 1 211 272 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Split                    splitncnn_56             1 3 272 273 274 275
Convolution              conv_162                 1 1 275 276 0=32 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=50176
Convolution              conv_163                 1 1 274 277 0=32 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=7168
Convolution              conv_164                 1 1 273 278 0=32 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=7168
BinaryOp                 add_22                   2 1 276 277 279 0=0
BinaryOp                 add_23                   2 1 279 278 280 0=0
Split                    splitncnn_57             1 3 280 281 282 283
Convolution              conv_165                 1 1 283 284 0=32 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=25600
Convolution              conv_166                 1 1 282 285 0=32 1=1 11=5 12=1 13=1 14=2 2=1 3=1 4=0 5=1 6=5120
Convolution              conv_167                 1 1 281 286 0=32 1=5 11=1 12=1 13=1 14=0 2=1 3=1 4=2 5=1 6=5120
BinaryOp                 add_24                   2 1 284 285 287 0=0
BinaryOp                 add_25                   2 1 287 286 288 0=0
Split                    splitncnn_58             1 3 288 289 290 291
Convolution              conv_168                 1 1 291 292 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_169                 1 1 290 293 0=32 1=1 11=3 12=1 13=1 14=1 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_170                 1 1 289 294 0=32 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=3072
BinaryOp                 add_26                   2 1 292 293 295 0=0
BinaryOp                 add_27                   2 1 295 294 296 0=0
Convolution              convrelu_31              1 1 296 297 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
BinaryOp                 add_28                   2 1 210 297 298 0=0
Convolution              conv_172                 1 1 208 299 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Split                    splitncnn_59             1 3 299 300 301 302
Convolution              conv_173                 1 1 302 303 0=32 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=50176
Convolution              conv_174                 1 1 301 304 0=32 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=7168
Convolution              conv_175                 1 1 300 305 0=32 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=7168
BinaryOp                 add_29                   2 1 303 304 306 0=0
BinaryOp                 add_30                   2 1 306 305 307 0=0
Split                    splitncnn_60             1 3 307 308 309 310
Convolution              conv_176                 1 1 310 311 0=32 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=25600
Convolution              conv_177                 1 1 309 312 0=32 1=1 11=5 12=1 13=1 14=2 2=1 3=1 4=0 5=1 6=5120
Convolution              conv_178                 1 1 308 313 0=32 1=5 11=1 12=1 13=1 14=0 2=1 3=1 4=2 5=1 6=5120
BinaryOp                 add_31                   2 1 311 312 314 0=0
BinaryOp                 add_32                   2 1 314 313 315 0=0
Split                    splitncnn_61             1 3 315 316 317 318
Convolution              conv_179                 1 1 318 319 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_180                 1 1 317 320 0=32 1=1 11=3 12=1 13=1 14=1 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_181                 1 1 316 321 0=32 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=3072
BinaryOp                 add_33                   2 1 319 320 322 0=0
BinaryOp                 add_34                   2 1 322 321 323 0=0
Convolution              convrelu_32              1 1 323 324 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
BinaryOp                 add_35                   2 1 207 324 325 0=0
Interp                   interpolate_3            1 1 244 326 0=1 1=8.000000e+00 2=8.000000e+00 6=0
Interp                   interpolate_4            1 1 271 327 0=1 1=4.000000e+00 2=4.000000e+00 6=0
Interp                   interpolate_5            1 1 298 328 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_7                    4 1 326 327 328 325 329 0=0
Convolution              convrelu_33              1 1 329 330 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Deconvolution            deconvrelu_0             1 1 330 331 0=64 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=16384 9=1
Split                    splitncnn_62             1 2 331 332 333
Deconvolution            deconv_187               1 1 333 334 0=1 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=0 6=256
BinaryOp                 add_36                   1 1 334 335 0=0 1=1 2=6.332400e-02
Sigmoid                  sigmoid_69               1 1 335 336
Split                    splitncnn_63             1 2 336 337 338
Interp                   interpolate_6            1 1 332 339 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_8                    2 1 337 339 340 0=0
Convolution              convrelu_34              1 1 340 341 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=37440 9=1
Convolution              conv_185                 1 1 341 342 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=64
BinaryOp                 add_37                   1 1 342 343 0=0 1=1 2=2.143000e-03
Sigmoid                  sigmoid_70               1 1 343 344
BinaryOp                 add_38                   2 1 338 344 345 0=0
Split                    splitncnn_64             1 2 345 346 347
BinaryOp                 mul_39                   1 1 346 out0 0=2 1=1 2=5.000000e-01
