7767517
172 216
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 9=1
Split                    splitncnn_0              1 2 1 2 3
Convolution              convrelu_1               1 1 3 4 0=16 1=2 11=2 12=1 13=1 2=1 3=1 4=-233 5=1 6=2048 9=1
Convolution              convrelu_2               1 1 4 5 0=32 1=2 11=2 12=1 13=1 2=1 3=1 4=-233 5=1 6=2048 9=1
Padding                  pad_7                    1 1 2 6 0=0 1=1 2=0 3=1 4=0 5=-3.402823e+38 6=0
Pooling                  maxpool2d_6              1 1 6 7 0=0 1=2 11=2 12=1 13=0 2=1 3=0 5=0
Concat                   cat_0                    2 1 7 5 8 0=0
Convolution              convrelu_3               1 1 8 9 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432 9=1
Convolution              convrelu_4               1 1 9 10 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=1
ConvolutionDepthWise     convdw_140               1 1 10 11 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_1              1 2 11 12 13
Convolution              convrelu_5               1 1 13 14 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_2              1 2 14 15 16
Convolution              convrelu_6               1 1 16 17 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_3              1 2 17 18 19
Convolution              convrelu_7               1 1 19 20 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_4              1 2 20 21 22
Convolution              convrelu_8               1 1 22 23 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_5              1 2 23 24 25
Convolution              convrelu_9               1 1 25 26 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_6              1 2 26 27 28
Convolution              convrelu_10              1 1 28 29 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Concat                   cat_1                    7 1 12 15 18 21 24 27 29 30 0=0
Convolution              convrelu_11              1 1 30 31 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=21504 9=1
Convolution              convrelu_12              1 1 31 32 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
ConvolutionDepthWise     convdw_141               1 1 32 33 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=2 4=1 5=1 6=1152 7=128
Split                    splitncnn_7              1 2 33 34 35
Convolution              convrelu_13              1 1 35 36 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592 9=1
Split                    splitncnn_8              1 2 36 37 38
Convolution              convrelu_14              1 1 38 39 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Split                    splitncnn_9              1 2 39 40 41
Convolution              convrelu_15              1 1 41 42 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Split                    splitncnn_10             1 2 42 43 44
Convolution              convrelu_16              1 1 44 45 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Split                    splitncnn_11             1 2 45 46 47
Convolution              convrelu_17              1 1 47 48 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Split                    splitncnn_12             1 2 48 49 50
Convolution              convrelu_18              1 1 50 51 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Concat                   cat_2                    7 1 34 37 40 43 46 49 51 52 0=0
Convolution              convrelu_19              1 1 52 53 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=180224 9=1
Convolution              convrelu_20              1 1 53 54 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072 9=1
ConvolutionDepthWise     convdw_142               1 1 54 55 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Split                    splitncnn_13             1 2 55 56 57
Convolution              conv_90                  1 1 57 58 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
ConvolutionDepthWise     convdwrelu_0             1 1 58 59 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_14             1 2 59 60 61
Convolution              conv_91                  1 1 61 62 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_1             1 1 62 63 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_15             1 2 63 64 65
Convolution              conv_92                  1 1 65 66 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_2             1 1 66 67 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_16             1 2 67 68 69
Convolution              conv_93                  1 1 69 70 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_3             1 1 70 71 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_17             1 2 71 72 73
Convolution              conv_94                  1 1 73 74 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_4             1 1 74 75 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_18             1 2 75 76 77
Convolution              conv_95                  1 1 77 78 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_5             1 1 78 79 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Concat                   cat_3                    7 1 56 60 64 68 72 76 79 80 0=0
Convolution              convrelu_21              1 1 80 81 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=851968 9=1
Convolution              convrelu_22              1 1 81 82 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
Split                    splitncnn_19             1 3 82 83 84 85
Convolution              conv_98                  1 1 85 86 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
ConvolutionDepthWise     convdwrelu_6             1 1 86 87 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_20             1 2 87 88 89
Convolution              conv_99                  1 1 89 90 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_7             1 1 90 91 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_21             1 2 91 92 93
Convolution              conv_100                 1 1 93 94 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_8             1 1 94 95 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_22             1 2 95 96 97
Convolution              conv_101                 1 1 97 98 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_9             1 1 98 99 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_23             1 2 99 100 101
Convolution              conv_102                 1 1 101 102 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_10            1 1 102 103 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_24             1 2 103 104 105
Convolution              conv_103                 1 1 105 106 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_11            1 1 106 107 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Concat                   cat_4                    7 1 83 88 92 96 100 104 107 108 0=0
Convolution              convrelu_23              1 1 108 109 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1114112 9=1
Convolution              convrelu_24              1 1 109 110 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
BinaryOp                 add_0                    2 1 110 84 111 0=0
Split                    splitncnn_25             1 3 111 112 113 114
Convolution              conv_106                 1 1 114 115 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
ConvolutionDepthWise     convdwrelu_12            1 1 115 116 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_26             1 2 116 117 118
Convolution              conv_107                 1 1 118 119 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_13            1 1 119 120 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_27             1 2 120 121 122
Convolution              conv_108                 1 1 122 123 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_14            1 1 123 124 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_28             1 2 124 125 126
Convolution              conv_109                 1 1 126 127 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_15            1 1 127 128 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_29             1 2 128 129 130
Convolution              conv_110                 1 1 130 131 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_16            1 1 131 132 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Split                    splitncnn_30             1 2 132 133 134
Convolution              conv_111                 1 1 134 135 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
ConvolutionDepthWise     convdwrelu_17            1 1 135 136 0=192 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=4800 7=192 9=1
Concat                   cat_5                    7 1 112 117 121 125 129 133 136 137 0=0
Convolution              convrelu_25              1 1 137 138 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1114112 9=1
Convolution              convrelu_26              1 1 138 139 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288 9=1
BinaryOp                 add_1                    2 1 139 113 140 0=0
ConvolutionDepthWise     convdw_161               1 1 140 141 0=1024 1=3 11=3 12=1 13=2 14=1 2=1 3=1 4=1 5=1 6=9216 7=1024
Split                    splitncnn_31             1 2 141 142 143
Convolution              conv_114                 1 1 143 144 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
ConvolutionDepthWise     convdwrelu_18            1 1 144 145 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384 9=1
Split                    splitncnn_32             1 2 145 146 147
Convolution              conv_115                 1 1 147 148 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
ConvolutionDepthWise     convdwrelu_19            1 1 148 149 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384 9=1
Split                    splitncnn_33             1 2 149 150 151
Convolution              conv_116                 1 1 151 152 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
ConvolutionDepthWise     convdwrelu_20            1 1 152 153 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384 9=1
Split                    splitncnn_34             1 2 153 154 155
Convolution              conv_117                 1 1 155 156 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
ConvolutionDepthWise     convdwrelu_21            1 1 156 157 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384 9=1
Split                    splitncnn_35             1 2 157 158 159
Convolution              conv_118                 1 1 159 160 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
ConvolutionDepthWise     convdwrelu_22            1 1 160 161 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384 9=1
Split                    splitncnn_36             1 2 161 162 163
Convolution              conv_119                 1 1 163 164 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
ConvolutionDepthWise     convdwrelu_23            1 1 164 165 0=384 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=9600 7=384 9=1
Concat                   cat_6                    7 1 142 146 150 154 158 162 165 166 0=0
Convolution              convrelu_27              1 1 166 167 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3407872 9=1
Convolution              convrelu_28              1 1 167 168 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2097152 9=1
Pooling                  avgpool2d_5              1 1 168 169 0=1 1=2 11=3 12=3 13=0 2=2 3=0 5=1 6=0
Split                    splitncnn_37             1 2 169 170 171
Convolution              conv_122                 1 1 171 172 0=256 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=1572864
Swish                    silu_61                  1 1 172 173
Convolution              conv_123                 1 1 173 174 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=30720
Swish                    silu_62                  1 1 174 175
Reshape                  reshape_137              1 1 175 176 0=-1 1=120
Permute                  permute_134              1 1 176 177 0=1
Split                    splitncnn_38             1 2 177 178 179
LayerNorm                ln_127                   1 1 179 180 0=120 1=1.000000e-05 2=1
MultiHeadAttention       attention_132            1 1 180 181 0=120 1=8 2=14400 3=120 4=120
BinaryOp                 add_2                    2 1 178 181 182 0=0
Split                    splitncnn_39             1 2 182 183 184
LayerNorm                ln_128                   1 1 184 185 0=120 1=1.000000e-05 2=1
Gemm                     gemm_0                   1 1 185 186 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=240 9=120
Swish                    silu_63                  1 1 186 187
Gemm                     gemm_1                   1 1 187 188 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=120 9=240
BinaryOp                 add_3                    2 1 183 188 189 0=0
Split                    splitncnn_40             1 2 189 190 191
LayerNorm                ln_129                   1 1 191 192 0=120 1=1.000000e-05 2=1
MultiHeadAttention       attention_133            1 1 192 193 0=120 1=8 2=14400 3=120 4=120
BinaryOp                 add_4                    2 1 190 193 194 0=0
Split                    splitncnn_41             1 2 194 195 196
LayerNorm                ln_130                   1 1 196 197 0=120 1=1.000000e-05 2=1
Gemm                     gemm_2                   1 1 197 198 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=240 9=120
Swish                    silu_64                  1 1 198 199
Gemm                     gemm_3                   1 1 199 200 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=120 9=240
BinaryOp                 add_5                    2 1 195 200 201 0=0
LayerNorm                ln_131                   1 1 201 202 0=120 1=1.000000e-06 2=1
Reshape                  reshape_138              1 1 202 203 0=120 1=-1 2=1
Permute                  permute_135              1 1 203 204 0=4
Convolution              conv_124                 1 1 204 205 0=2048 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=245760
Swish                    silu_65                  1 1 205 206
Concat                   cat_7                    2 1 170 206 207 0=0
Convolution              conv_125                 1 1 207 208 0=256 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=3145728
Swish                    silu_66                  1 1 208 209
Convolution              conv_126                 1 1 209 210 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=30720
Swish                    silu_67                  1 1 210 211
Squeeze                  squeeze_139              1 1 211 212 -23303=1,1
Permute                  permute_136              1 1 212 213 0=1
Gemm                     gemm_4                   1 1 213 214 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=18385 9=120
Softmax                  softmax_68               1 1 214 out0 0=1 1=1
